from django.shortcuts import render

blog_post = [
    {
        'title': "ভালো শুরুর পরও বাংলাদেশ ২৫৬",
        'content': "ঊরুর চোটের কারণে ম্যাচটা খেলছেন না সাকিব আল হাসান। তাতে বিশ্বকাপের মঞ্চে বাংলাদেশ দলকে নেতৃত্ব দেওয়ার সুযোগ আসে নাজমুল হোসেনের। পুনের ব্যাটিং স্বর্গে টস ভাগ্য গেছে তাঁর পক্ষেই। কিন্তু আগে ব্যাটিংয়ের সিদ্ধান্ত নেওয়া বাংলাদেশ মহারাষ্ট্র ক্রিকেট অ্যাসোসিয়েশন স্টেডিয়ামের ব্যাটিং কন্ডিশনের সুবিধা কতটা কাজে লাগাতে পারল, সে প্রশ্ন থেকেই যায়। উদ্বোধনী জুটিতে ১৪.৪ ওভারে ৯৩ রান পাওয়ার পরও বাংলাদেশ দলের ইনিংস যে যেতে পেরেছে  ৮ উইকেটে ২৫৬ রান পর্যন্তই।",
        'author': "লিটন",
        'post_create_date': "১৯ অক্টোবর ২০২৩",
    },
    {
        'title': "সেই বিশ্বকাপ, সেই ভারত, অন্য তামিম",
        'content': "তামিম ইকবালকে ক্রিকেট–বিশ্ব কিভাবে চিনেছিল? চিনেছিল বিশ্বকাপে ভারতের বিপক্ষে ৫১ রানের একটা ইনিংসে। ২০০৭ বিশ্বকাপে পোর্ট অব স্পেনে স্মরণীয় সেই জয়। যেটির রূপকার হিসেবে একজনের নাম বলা ঠিক হবে না। বোলিংয়ে মাশরাফি বিন মুর্তজার ৪ উইকেট। এরপর ব্যাটিংয়ে তিন তরুণ তুর্কির অর্ধশতক। মুশফিকুর রহিম ও সাকিব আল হাসানও রাঙিয়ে তুলেছিলেন বিশ্বকাপে অভিষেকের লগ্নটাকে। তবে ওই ম্যাচের কথা উঠলে বাকি সব ছাপিয়ে প্রথমেই চোখে ভাসে তামিম ইকবালের উদ্ধত ব্যাটিং। ডাউন দ্য উইকেট গিয়ে জহির খানকে সোজা তুলে মারা ছক্কা।",
        'author': "তামিম",
        'post_create_date': "১৯ অক্টোবর ২০২৩",

    }
]


def home(request):
    return render(request, 'blog/home.html', {'blog_post': blog_post})
def about(request):
    return render(request,'blog/about.html',{'title':"About Page"})